moralkerim/STM32Quadrotor/Drone_Controller_3DOF/Core/Src/main.cpp
/* USER CODE BEGIN Header */
/**
 * TO DO:
 * -Log gps velocity
 * -Decrease position controller rate
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include <Kalman.hpp>
#include "main.h"
#include "dma.h"
#include "i2c.h"
#include "spi.h"
#include "tim.h"
#include "usart.h"
#include "gpio.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

#include <main.hpp>
#include "stdio.h"
#include <string.h>
#include <math.h>
#include "coordinates.hpp"

#include "Controller.hpp"
#include "TelemData.h"

extern "C" {
	#include "bmp180.h"
	#include "gy-us42v2.h"
	#include "HMC5883L.h"
	#include "NMEA.h"
	#include "moving-median.h"
	#include "nrf24.h"
	#include "bno055_stm32.h"

}

#include "Modes.h"
#include "state.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */
//MPU6050
/*
#define MPU6050 (0x68<<1)
#define MPU6050_POW_REG 0x6b
#define MPU6050_DLPF_REG 0x1a
#define GYRO_CONF_REG 0x1b
#define ACC_CONF_REG 0x1c
#define GYRO_X_ADDR 0x43
#define GYRO_Y_ADDR 0x45
#define GYRO_Z_ADDR 0x47
#define ACC_X_ADDR 0x3B
#define ACC_Y_ADDR 0x3D
#define ACC_Z_ADDR 0x3F
*/

#define BMO_DEBUG
#define MPU6050 (0x68<<1)
#define MPU6050_POW_REG 0x3e
#define MPU6050_DLPF_REG 0x1a
#define GYRO_CONF_REG 0x16
#define GYRO_X_ADDR 0x1D
#define GYRO_Y_ADDR 0x1F
#define GYRO_Z_ADDR 0x21

#define ADXL345 (0x53<<1)
#define ACC_CONF_REG 0x2c
#define ACC_X_ADDR 0x32
#define ACC_Y_ADDR 0x34
#define ACC_Z_ADDR 0x36

#define FULL_CLOCK 200
#define CNTRL_CLOCK 400
#define SONAR_CLOCK 16

#define SONAR_CLOCK_RATE 20
#define MAG_CLOCK_RATE   4
#define GPS_CLOCK_RATE   40
#define CONTROLLER_RATE  1

#define ACC_FAIL_LIM 1

#define I2C_READ 0x01

#ifndef PWM_UPPER
	#define PWM_UPPER 1800
	#define PWM_LOWER 1050
#endif

#define CH_NUM 10
#define CH0 5000
#define EMERGENCY_CH 5
#define SWARM_CH 6
#define MAGNET_CH 7
#define MOD_CH 8
#define CH3_MIN 1000


/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
const float Sx = -0.0030;
const float Sy = -0.0055;
const float Sz =  -0.0254;

const float bx = -0.4900;
const float by = -1.1850+14;
const float bz = 3.2050;

float gyroX, gyroY, gyroZ, accX, accY, accZ;
float accXc, accYc, accZc;
float accXm, accYm, accZm;
float GyroXh, GyroYh, GyroZh, AccXh, AccYh, AccZh;

//Office
//float lla0[3] = {40.4343109, 29.1589451, 10};

//Zeytinlik
//float lla0[3] = {40.4372482, 29.1656475, 10};

//Home
//float lla0[3] = {40.4352608, 29.1620464, 39.7999992};
float lla0[3], lla0_mean[3];

struct state state_des;
struct state state;
struct telem_pack telem_pack;

const float st = 0.0025;
const float deg2rad = 0.0174;
//PD Katsayilari

int IC_val1, IC_val2, pwm_input;
char buf[sizeof(telem_pack)];
Kalman_Filtresi EKF;
Controller controller;
int controller_output[4];
int controller_output_2[4];

bool Is_First_Captured;
volatile int IC_Val2, IC_Val1, Diff, Diff_debug;
volatile short int i;
int ch[CH_NUM+1], ch_[CH_NUM+1], _ch[CH_NUM+1];
unsigned short int sync;
long int delay_timer, current_time, arm_timer, test_timer, disarm_timer, sent_time;
bool delay_start, arm_start, armed, motor_start, disarm_start, sonar_ready;
float baro_alt, sonar_alt, sonar_alt_, sonar_vel, sonar_vel_, sonar_acc, alt, alt_gnd, vz, baro_gnd;
unsigned int sonar_range;
unsigned short int controller_counter, sonar_counter, camera_counter, mag_counter, gps_counter;
bmp_t bmp;
float z0;
int ch_count;
bool home = false;

long controller_timer, _controller_timer, controller_timer_dif;
unsigned int home_counter;
struct cam_data cam_data;
struct cam_data cam_data_20;
struct attitude euler_angles;
unsigned long gga_time, gga_time_dif;
int16_t MAG_X, MAG_Y, MAG_Z;
int16_t MAG_X_CALIB, MAG_Y_CALIB, MAG_Z_CALIB;
bool ch_init;

uint16_t roll_des_wifi;
char roll_des_buf[sizeof(uint16_t)];

struct pwm ch_rcv;
char ch_rcv_buf[sizeof(ch_rcv)];

struct swarm_pack swarm_pack;
char swarm_rcv_buf[sizeof(swarm_pack)];

unsigned short int failsafe_counter;
bool in_failsafe;
float Fail_Acc;
uint8_t period;
bno055_vector_t v, bno_dat, bno_gyro;

typedef enum {
	POSITIVE,
	NEGATIVE,
	NEUTRAL
}sign;

typedef enum {
	NORMAL,
	SWARM
}SWARM_MODE;

typedef enum {
	start,
	stop,
	package
}TX_TYPE;

TX_TYPE tx_type = start;
SWARM_MODE swarm_mode = NORMAL;

sign yaw_sign = NEUTRAL;
int8_t yaw_counter;
uint16_t jump_counter;
float yaw_prev;


uint64_t TxpipeAddrs = 122;


uint64_t RxpipeAddrs = 122;
struct pwm pwm_out;
uint8_t gyro_conf[1];
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
/* USER CODE BEGIN PFP */
void MPU6050_Baslat(void);
int16_t GyroOku (uint8_t addr);
int16_t AccOku (uint8_t addr);
float GyroErr(uint8_t addr);
float AccErr(uint8_t addr);
void TelemPack(void);
void SendTelem(void);
void PWMYaz();
float pwm2ang(unsigned short int pwm);
float pwm2rate(unsigned short int pwm);
void checkMode(int mod_ch);
void MotorBaslat(void);
void Check_Arm(void);
void Check_Disarm(void);
float square(float x);
void MagCalib(int16_t MAG_X,int16_t MAG_Y,int16_t MAG_Z);
//void GPSInit();
//void SetHome();
//void SetHome2();
void CheckFailsafe();
void CheckSwarm();
void SwitchMag();
struct attitude DCM2Euler(int16_t acc[3], int16_t mag[3]);
int _write(int32_t file, uint8_t *ptr, int32_t len);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

int __io_putchar(int ch)
{
 // Write character to ITM ch.0
 ITM_SendChar(ch);
 return(ch);
}

