moralkerim/STM32Quadrotor/Drone_Controller_3DOF/Core/Src/main.cpp
void Delay(long millis) {
	current_time = delay_timer;
	while(delay_timer < current_time + millis) {
		printf("Do nothing...");
	}
}

void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart) {
	if(huart->Instance == huart2.Instance) {
		char end_char;
		switch(tx_type) {
		case start:
			end_char = 0x01;
			HAL_UART_Transmit_DMA(&huart2, (uint8_t*)&end_char, sizeof(end_char));
			tx_type = package;
			break;

		case package:
			HAL_UART_Transmit_DMA(&huart2, (uint8_t*)buf, sizeof(struct telem_pack));
			tx_type = stop;
			break;

		case stop:
			end_char = 0x04;
		    HAL_UART_Transmit_DMA(&huart2, (uint8_t*)&end_char, sizeof(end_char));
		    tx_type = start;

		    long int sent_time_ = sent_time;
		    sent_time = HAL_GetTick();
		    period = sent_time - sent_time_;
		    break;
		}

	}
}


/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */
	//Delay(500);
	//HAL_Delay(1000);

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */
  HAL_Delay(2000);
  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_I2C1_Init();
  MX_TIM2_Init();
  MX_TIM1_Init();
  MX_USART2_UART_Init();
  MX_TIM3_Init();
  MX_TIM4_Init();
  MX_USART1_UART_Init();
  MX_USART3_UART_Init();
  MX_SPI1_Init();
  /* USER CODE BEGIN 2 */

  HAL_UART_Receive_DMA(&huart1, (uint8_t*)&cam_data, sizeof(cam_data));

  //HAL_UART_Receive_DMA(&huart2, (uint8_t*)ch_rcv_buf, 1);
  //HAL_UART_Receive_DMA(&huart1, rx_buffer, sizeof(cam_data)-1);
#ifdef BMO_DEBUG
  bno055_assignI2C(&hi2c1);
  bno055_setup();
  bno055_setOperationModeNDOF();
  //bno055_setAxisDefualt();
  bno055_axis_map_t axis = {
    .x = BNO055_AXIS_Z,
    .x_sign = BNO055_AXIS_SIGN_POSITIVE,
    .y = BNO055_AXIS_X,
    .y_sign = BNO055_AXIS_SIGN_POSITIVE,
    .z = BNO055_AXIS_Y,
    .z_sign = BNO055_AXIS_SIGN_POSITIVE
  };
  bno055_setAxisMap(axis);
#endif

#ifdef UAV1
  MPU6050_Baslat();
  bmp_init(&bmp);
  HMC5883L_initialize();
#endif
  MotorBaslat();
  //GPSInit();
  HAL_Delay(1000);

  Ringbuf_init();

	/***********NRF Ayarlari****************/

#ifdef UAV1

	NRF24_begin(CE_GPIO_Port, CSN_Pin, CE_Pin, hspi1);
	NRF24_stopListening();
	NRF24_openWritingPipe(TxpipeAddrs);
	nrf24_DebugUART_Init(huart3);
	NRF24_setAutoAck(false);
	NRF24_setChannel(34);
	NRF24_setPayloadSize(sizeof(struct pwm));
	char test_data[] = "Testing...";
	HAL_UART_Transmit(&huart3, (uint8_t*)&test_data, sizeof(test_data), 5);
	printRadioSettings();

#endif

#ifdef UAV2
	NRF24_begin(CE_GPIO_Port, CSN_Pin, CE_Pin, hspi1);
	nrf24_DebugUART_Init(huart3);
	NRF24_setAutoAck(false);
	NRF24_setChannel(34);
	NRF24_setPayloadSize(sizeof(struct pwm));
	NRF24_openReadingPipe(1, RxpipeAddrs);
	NRF24_startListening();
	char test_data[] = "Testing...";
	HAL_UART_Transmit(&huart3, (uint8_t*)&test_data, sizeof(test_data), 5);
	printRadioSettings();
#endif

  //Gyro kalibrasyon hatalarını hesapla.
  HAL_Delay(5000);

#ifdef UAV1

  GyroXh = GyroErr(GYRO_X_ADDR); GyroYh=GyroErr(GYRO_Y_ADDR); GyroZh=GyroErr(GYRO_Z_ADDR);
  AccXh = AccErr(ACC_X_ADDR)* .0078; AccYh = AccErr(ACC_Y_ADDR)* .0078; AccZh = AccErr(ACC_Z_ADDR)* .0078;

  //İvmeölçer degerlerini oku

  accX = AccOku(ACC_X_ADDR);
  accY = AccOku(ACC_Y_ADDR);
  accZ = AccOku(ACC_Z_ADDR);
#endif
  //Kontrolcü Timer'ı
  HAL_TIM_Base_Start_IT(&htim2);

  //Micros timer
  HAL_TIM_Base_Start(&htim3);


  //PWM çıkış timer'ları
  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);
  HAL_TIMEx_PWMN_Start(&htim1, TIM_CHANNEL_2);
  HAL_TIMEx_PWMN_Start(&htim1, TIM_CHANNEL_3);
  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_4);

  //PPM Input Capture Kanalları
  //HAL_TIM_IC_Start_IT(&htim3, TIM_CHANNEL_2);
  HAL_TIM_IC_Start_IT(&htim3, TIM_CHANNEL_3);

  //ESP DMA Başlat.
  char end_char = 0x01;
  HAL_UART_Transmit_DMA(&huart2, (uint8_t*)&end_char, sizeof(end_char));
  tx_type = package;
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */

  while (1)
  {
	#ifdef UAV2
			if(NRF24_available())
			{
				char nrf_buf[sizeof(struct pwm)];
				NRF24_read(nrf_buf, sizeof(struct pwm));

				memcpy(&pwm_out, nrf_buf , sizeof(struct pwm));


				//Check if the incoming data is healthy or not.
				short unsigned int *p;
				p = &pwm_out.w1;

				bool data_healthy = true;

				for(int i=0; i<4; i++) {
					if(*(p+i) > 2000 || *(p+i) < 1000) {
						unsigned int val = *(p+i);
						data_healthy = false;
						break;
					}
				}

				//Give healthy datas to outputs.
				if(data_healthy) {
					controller_output_2[0] = pwm_out.w1;
					controller_output_2[1] = pwm_out.w2;
					controller_output_2[2] = pwm_out.w3;
					controller_output_2[3] = pwm_out.w4;
				}

				HAL_GPIO_TogglePin(LED_GPIO_Port, LED_Pin);
				//HAL_UART_Transmit(&huart3, (uint8_t *)RxData, 32, 10);
			}

			else {
				controller_output_2[0] = 1000;
				controller_output_2[1] = 1000;
				controller_output_2[2] = 1000;
				controller_output_2[3] = 1000;
			}

	#endif


    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }
  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    Error_Handler();
  }
}

/* USER CODE BEGIN 4 */
void MPU6050_Baslat(void) {
	uint8_t config = 0x00;
	HAL_I2C_Mem_Write(&hi2c1, (uint16_t)MPU6050, MPU6050_POW_REG, 1, &config, 1, 50); //Güç registerını aktif et
	HAL_Delay(5);
	//config = 0x18; //NO DLPF
	config = 0x1B; //1B 42Hz DLPF || 1C 20Hz DLPF
	HAL_I2C_Mem_Write(&hi2c1, (uint16_t)MPU6050, GYRO_CONF_REG, 1, &config, 1, 50); //Gyro 250 d/s'ye ayarlandi.
	HAL_Delay(5);


	HAL_I2C_Mem_Read(&hi2c1, (uint16_t)MPU6050 | I2C_READ, GYRO_CONF_REG, 1, gyro_conf, 1, 5);

