moralkerim/STM32Quadrotor/Drone_Controller_3DOF/Core/Src/main.cpp
	  telem_pack.sonar_alt = EKF.roll_bias;
	  telem_pack.velocity_body.z = controller.angle_ff_roll;
	  telem_pack.position_body.z = controller.angle_ff_pitch;

	  telem_pack.cam_data.detected = cam_data_20.detected;
	  telem_pack.cam_data.x = cam_data_20.x;
	  telem_pack.cam_data.y = cam_data_20.y;
	  telem_pack.cam_data.z_cam = cam_data_20.z_cam;


//	  telem_pack.position_body.x = EKF.x;
//	  telem_pack.velocity_body.x = EKF.vx;
//	  telem_pack.position_body.y = EKF.y;
//	  telem_pack.velocity_body.y = EKF.vy;

	  telem_pack.alt_thr = controller.alt_thr;

	  telem_pack.time_millis = HAL_GetTick();

	  telem_pack.acc.x = accXc;
	  telem_pack.acc.y = accYc;
	  telem_pack.acc.z = accZm;

	  telem_pack.mag.x = MAG_X_CALIB;
	  telem_pack.mag.y = MAG_Y_CALIB;
	  telem_pack.mag.z = MAG_Z_CALIB;

	  /*
	  telem_pack.gps.lla.x = gpsData.ggastruct.lcation.latitude;
	  telem_pack.gps.lla.y = gpsData.ggastruct.lcation.longitude;

	  telem_pack.gps.pos_body.x = EKF.xbody;
	  telem_pack.gps.pos_body.y = EKF.ybody;

	  telem_pack.gps.pos_ned.x = EKF.xned;
	  telem_pack.gps.pos_ned.y = EKF.yned;

	  telem_pack.gps.vel_body.x = EKF.vgpsx;
	  telem_pack.gps.vel_body.y = EKF.vgpsy;
	   */

	  telem_pack.ch.ch1 = (uint16_t)ch[0];
	  telem_pack.ch.ch2 = (uint16_t)ch[1];
	  telem_pack.ch.ch3 = (uint16_t)ch[2];
	  telem_pack.ch.ch4 = (uint16_t)ch[3];
	  telem_pack.ch.ch5 = (uint16_t)ch[4];
	  telem_pack.ch.ch6 = (uint16_t)ch[5];
	  telem_pack.ch.ch7 = (uint16_t)ch[6];
	  telem_pack.ch.ch8 = (uint16_t)ch[7];
	  telem_pack.ch.ch9 = (uint16_t)ch[8];
	  telem_pack.ch.ch10 = (uint16_t)ch[9];
	  telem_pack.ch.ch11 = (uint16_t)ch[10];

	  telem_pack.pwm2.w1 = controller_output_2[0];
	  telem_pack.pwm2.w2 = controller_output_2[1];
	  telem_pack.pwm2.w3 = controller_output_2[2];
	  telem_pack.pwm2.w4 = controller_output_2[3];

//	  telem_pack.S_roll.S11 = EKF.S11_roll;
//	  telem_pack.S_roll.S12 = EKF.S12_roll;
//	  telem_pack.S_roll.S13 = EKF.S13_roll;
//	  telem_pack.S_roll.S21 = EKF.S21_roll;
//	  telem_pack.S_roll.S22 = EKF.S22_roll;
//	  telem_pack.S_roll.S23 = EKF.S23_roll;
//	  telem_pack.S_roll.S31 = EKF.S31_roll;
//	  telem_pack.S_roll.S32 = EKF.S32_roll;
//	  telem_pack.S_roll.S33 = EKF.S33_roll;
//
//	  telem_pack.S_pitch.S11 = EKF.S11_pitch;
//	  telem_pack.S_pitch.S12 = EKF.S12_pitch;
//	  telem_pack.S_pitch.S13 = EKF.S13_pitch;
//	  telem_pack.S_pitch.S21 = EKF.S21_pitch;
//	  telem_pack.S_pitch.S22 = EKF.S22_pitch;
//	  telem_pack.S_pitch.S23 = EKF.S23_pitch;
//	  telem_pack.S_pitch.S31 = EKF.S31_pitch;
//	  telem_pack.S_pitch.S32 = EKF.S32_pitch;
//	  telem_pack.S_pitch.S33 = EKF.S33_pitch;
//
//	  telem_pack.S_yaw.S11 = EKF.S11_yaw;
//	  telem_pack.S_yaw.S12 = EKF.S12_yaw;
//	  telem_pack.S_yaw.S13 = EKF.S13_yaw;
//	  telem_pack.S_yaw.S21 = EKF.S21_yaw;
//	  telem_pack.S_yaw.S22 = EKF.S22_yaw;
//	  telem_pack.S_yaw.S23 = EKF.S23_yaw;
//	  telem_pack.S_yaw.S31 = EKF.S31_yaw;
//	  telem_pack.S_yaw.S32 = EKF.S32_yaw;
//	  telem_pack.S_yaw.S33 = EKF.S33_yaw;

	  telem_pack.bno_attitude.roll  = bno_dat.x;
	  telem_pack.bno_attitude.pitch = bno_dat.y;
	  telem_pack.bno_attitude.yaw   = bno_dat.z;

	  telem_pack.bno_rates.roll  = bno_gyro.x;
	  telem_pack.bno_rates.pitch = bno_gyro.y;
	  telem_pack.bno_rates.yaw   = bno_gyro.z;

	  memcpy(buf,&telem_pack,sizeof(telem_pack));
}

void SendTelem() {
	  TelemPack();
	  char end_char = 0x01;
	  HAL_UART_Transmit_DMA(&huart2, (uint8_t*)&end_char, sizeof(end_char));
	  HAL_UART_Transmit_DMA(&huart2, (uint8_t*)buf, sizeof(struct telem_pack));
	  end_char = 0x04;
	  HAL_UART_Transmit_DMA(&huart2, (uint8_t*)&end_char, sizeof(end_char));

	  sent_time = HAL_GetTick();


}

int16_t GyroOku (uint8_t addr) {
	uint8_t gyro_data[2];
	HAL_I2C_Mem_Read(&hi2c1, (uint16_t)MPU6050 | I2C_READ, addr, 1, gyro_data, 2, 1);
	int16_t gyro = gyro_data[0]<<8 | gyro_data[1];
	return gyro;
}

void GPSInit() {
	uint8_t Disable_GPGSV[11] = {0xB5, 0x62, 0x06, 0x01, 0x03, 0x00, 0xF0, 0x03, 0x00, 0xFD, 0x15};
	HAL_UART_Transmit(&huart3, (uint8_t*)Disable_GPGSV, 11, 100);
	uint8_t Set_to_5Hz[14] = {0xB5, 0x62, 0x06, 0x08, 0x06, 0x00, 0xC8, 0x00, 0x01, 0x00, 0x01, 0x00, 0xDE, 0x6A};
	HAL_UART_Transmit(&huart3, (uint8_t*)Set_to_5Hz, 14, 100);
	uint8_t Set_to_115[28] = {0xB5, 0x62, 0x06, 0x00, 0x14, 0x00, 0x01, 0x00, 0x00, 0x00, 0xD0, 0x08, 0x00, 0x00, 0x00, 0xC2, 0x01, 0x00, 0x07, 0x00, 0x03, 0x00, 0x00, 0x00, 0x00, 0x00, 0xC0, 0x7E};
	HAL_UART_Transmit(&huart3, (uint8_t*)Set_to_115, 28, 100);


    HAL_UART_Abort_IT(&huart3);

    HAL_UART_DeInit(&huart3);

    huart3.Init.BaudRate = 115200;

    if (HAL_UART_Init(&huart3) != HAL_OK) {
        Error_Handler();
    }


}

float pwm2ang(unsigned short int pwm) {
	int dead_zone = 5;

	int in_min  = 1000;
	int in_max  = 2000;

	/*
	int in_min  = 1160;
	int in_max  = 1850;
	*/
	int out_min = -20;
	int out_max  = 20;
	unsigned short int pwm_out;

	if(pwm > 1500 - dead_zone && pwm < 1500 + dead_zone) {
		pwm_out = 1500;
	}

	else {
		pwm_out = pwm;
	}

	return (pwm_out - in_min) * (out_max - out_min) / (in_max - in_min) + out_min;
}

float pwm2rate(unsigned short int pwm) {

	int in_min  = 1000;
	int in_max  = 2000;

	/*
	int in_min  = 1160;
	int in_max  = 1850;
	 */
	int out_min = -100;
	int out_max  = 100;

	return -1 * ((pwm - in_min) * (out_max - out_min) / (in_max - in_min) + out_min);
}


int16_t AccOku (uint8_t addr) {
	uint8_t gyro_data[2];
	HAL_I2C_Mem_Read(&hi2c1, (uint16_t)ADXL345 | I2C_READ, addr, 1, gyro_data, 2, 1);
	int16_t gyro = (gyro_data[1]<<8) | gyro_data[0];
	return gyro;
}

struct attitude DCM2Euler(int16_t acc[3], int16_t mag[3]) {
	struct attitude euler_angles;
	float rad2deg = 180.0/3.14;
	float acctop = sqrt(acc[0]*acc[0] + acc[1]*acc[1] + acc[2]*acc[2]);

//	  EKF.ekf_update = false;
//	  if((0.0078*acctop > 1-EKF.kalman_acc_thres) && (0.0078*acctop < 1+EKF.kalman_acc_thres)) {
//		  EKF.ekf_update = true;
//	  }

	//float A = (acctop*sqrt(square(acc[0]*mag[1] - acc[1]*mag[0]) + square(acc[0]*mag[2] - acc[2]*mag[0]) + square(acc[1]*mag[2] - acc[2]*mag[1])));
	//float DCM11 = (mag[0]*acc[1]*acc[1] - acc[0]*mag[1]*acc[1] + mag[0]*acc[2]*acc[2] - acc[0]*mag[2]*acc[2])/A;
	float DCM11 = (mag[0]*acc[1]*acc[1] - acc[0]*mag[1]*acc[1] + mag[0]*acc[2]*acc[2] - acc[0]*mag[2]*acc[2])/(acctop*sqrt(square(acc[0]*mag[1] - acc[1]*mag[0]) + square(acc[0]*mag[2] - acc[2]*mag[0]) + square(acc[1]*mag[2] - acc[2]*mag[1])));
	//A = sqrt(square(acc[0]*mag[1] - acc[1]*mag[0]) + square(acc[0]*mag[2] - acc[2]*mag[0]) + square(acc[1]*mag[2] - acc[2]*mag[1]));
	//float DCM21 = -(acc[1]*mag[2] - acc[2]*mag[1])/A;
	float DCM21 = -(acc[1]*mag[2] - acc[2]*mag[1])/sqrt(square(acc[0]*mag[1] - acc[1]*mag[0]) + square(acc[0]*mag[2] - acc[2]*mag[0]) + square(acc[1]*mag[2] - acc[2]*mag[1]));


	float DCM31 = -acc[0]/acctop;
	float DCM32 = -acc[1]/acctop;
	float DCM33 = -acc[2]/acctop;
	//euler_angles.pitch = rad2deg*atan2(-DCM31,x);
	float pitch = asin(-DCM31);
	float cp = cos(pitch);

	euler_angles.pitch = rad2deg*pitch;
	//pitch = asin(pitch);
	euler_angles.roll = rad2deg*atan(DCM32/DCM33);
	float yaw = rad2deg*atan2(DCM21/cp,DCM11/cp);
	//-euler_angles.yaw  = rad2deg*atan2(DCM21,DCM11);

	//EKF.yaw_update_enable = true;
	//float yaw_ekf = EKF.state.angles[2];
//    while(yaw_ekf < yaw_prev-180) {
//        yaw = yaw + 360;
//        yaw_ekf = yaw_ekf + 360;
//        //EKF.yaw_update_enable = false;
//    }
//    while(yaw_ekf > yaw_prev+180) {
//        yaw = yaw - 360;
//        yaw_ekf = yaw_ekf - 360;
//        //EKF.yaw_update_enable = false;
//
//    }

