moralkerim/STM32Quadrotor/Drone_Controller_3DOF/Core/Src/main.cpp
	float threshold = 200;
	// Check if the yaw angle has crossed the discontinuity
	if (abs(yaw - yaw_prev) > threshold) {
	  // Add or subtract 2*pi to the yaw angle to bring it back into the range (-pi, pi)
	  if (yaw > yaw_prev)
		yaw -= 2*180;
	  else
		yaw += 2*180;

	// Store the current yaw angle for the next iteration
	}
    yaw_prev = yaw;
	euler_angles.yaw = yaw;

	/*
	switch(yaw_sign) {
		case POSITIVE:
			euler_angles.yaw += 360;
			break;
		case NEGATIVE:
			euler_angles.yaw -=360;
			break;
	}
*/
	//euler_angles.yaw = (atan2((float) mag[1], (float) mag[0]) * 180 / M_PI);
	//yaw = acos(yaw);
	//euler_angles.pitch  = rad2deg*pitch;
	//euler_angles.roll   = rad2deg*roll;
	//euler_angles.yaw    = rad2deg*yaw;
	return euler_angles;

}

float square(float x) {
	float y = x*x;
	return y;
}

void PWMYaz() {

	/*
  if(!motor_start) {
			  MotorBaslat();
			  motor_start = true;
		  }

*/

#ifdef UAV1


		  if(armed) {

			  if(in_failsafe) {
				  __HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_1,1300);
				  __HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_2,1300);
				  __HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_3,1300);
				  __HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_4,1300);
			  }

			  else {
				  if(ch[EMERGENCY_CH-1] < 1500 && ch[3-1] > CH3_MIN + 100) {
						  __HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_1,controller_output[0]);
						  __HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_2,controller_output[1]);
						  __HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_3,controller_output[2]);
						  __HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_4,controller_output[3]);

					  }

					  else  {
						  __HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_1,1000);
						  __HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_2,1000);
						  __HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_3,1000);
						  __HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_4,1000);

					  }
				  }


			  }

		  else {
			  __HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_1,1000);
			  __HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_2,1000);
			  __HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_3,1000);
			  __HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_4,1000);
		  }




#endif

#ifdef UAV2

	  if(ch[EMERGENCY_CH-1] < 1500) {

			  __HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_1,controller_output_2[0]);
			  __HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_2,controller_output_2[1]);
			  __HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_3,controller_output_2[2]);
			  __HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_4,controller_output_2[3]);





	  }

	  else {
		  __HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_1,1000);
		  __HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_2,1000);
		  __HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_3,1000);
		  __HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_4,1000);
	  }
#endif

}


float GyroErr(uint8_t addr) {
	float GyroXh=0;
	for (int i=0; i<2000; i++)
	{
		GyroXh += (GyroOku(addr));

	} //Haberleşmeyi durdur.
	GyroXh=GyroXh/2000; //Son okunan değeri 2000'e böl.
	return GyroXh;
}

float AccErr(uint8_t addr) {
	float GyroXh=0;
	for (int i=0; i<2000; i++)
	{
		GyroXh += (AccOku(addr));

	} //Haberleşmeyi durdur.
	GyroXh=GyroXh/2000; //Son okunan değeri 2000'e böl.
	return GyroXh;
}

void MotorBaslat(void) {
	  __HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_1,1000);
	  __HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_2,1000);
	  __HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_3,1000);
	  __HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_4,1000);
	 // Delay(600);
	HAL_Delay(1000);
}

int _write(int32_t file, uint8_t *ptr, int32_t len) {
	/* Implement your write code here, this is used by puts and printf for example */
	int i = 0;
	for(i=0; i < len; i++) {
		ITM_SendChar((*ptr++));
	}
	return len;
}
/*
void SetHome() {
	home_counter++;
	if(home_counter != 11) {
		lla0_mean[0]  += gpsData.ggastruct.lcation.latitude;
		lla0_mean[1] += gpsData.ggastruct.lcation.longitude;
		lla0_mean[2] += gpsData.ggastruct.alt.altitude;
	}

	else {
		home_counter = 0;

		lla0[0] = lla0_mean[0]/10;
		lla0[1] = lla0_mean[1]/10;
		lla0[2] = lla0_mean[2]/10;

		lla0_mean[0] = 0;
		lla0_mean[1] = 0;
		lla0_mean[2] = 0;

		home = true;
	}

}

void SetHome2() {
		lla0[0] = gpsData.ggastruct.lcation.latitude;
		lla0[1] = gpsData.ggastruct.lcation.longitude;
		lla0[2] = gpsData.ggastruct.alt.altitude;

		home = true;
}
*/

//Ana Kontrolcü döngüsü
void HAL_TIM_PeriodElapsedCallback (TIM_HandleTypeDef * htim) {

	if(htim == &htim2) {
		//1.25 ms || 800 Hz
		Check_Arm();
		Check_Disarm();

		set_ucounter(SONAR_CLOCK_RATE);
		set_b_counter(12);

		controller_counter++;
		camera_counter++;
		mag_counter++;

#ifdef UAV1


		if(mag_counter == MAG_CLOCK_RATE) {
			mag_counter = 0;
			HMC5883L_getMagData(&MAG_X, &MAG_Y, &MAG_Z);
			MagCalib(MAG_X, MAG_Y, MAG_Z);
			int16_t mag[3];
			mag[0] = MAG_X_CALIB;
			mag[1] = MAG_Y_CALIB;
			mag[2] = MAG_Z_CALIB;

			int16_t acc[3];
			acc[0] = accX;
			acc[1] = accY;
			acc[2] = accZ;
			euler_angles = DCM2Euler(acc, mag);

		}

		if(camera_counter == 40) {
			  camera_counter = 0;
			  memcpy(&cam_data_20, &cam_data, sizeof(cam_data));
			  EKF.camx = (float)cam_data.y/100.0;

			  if(!cam_data.detected) {
				  EKF.Qc = 9e9;
			  }

			  else {
				  EKF.Qc = 2.7e-2;
			  }
		}

		if(get_ucounter() == 1) {
			request_range();
			//sonar_range = getRange();
		}


		else if (get_ucounter() == SONAR_CLOCK_RATE) {

		  sonar_range = getRange();
		  sonar_alt_ = sonar_alt;
		  sonar_vel_ = sonar_vel;

		  float sonar_roll = abs(deg2rad*state.angles[0]);
		  float sonar_pitch = abs(deg2rad*state.angles[1]);
		  sonar_alt = (float)sonar_range/100.0 * cos(sonar_roll)* cos(sonar_pitch);
		  float sonar_st = (float)(1.0/SONAR_CLOCK);
		  sonar_vel = (sonar_alt - sonar_alt_)/sonar_st;


		  if (abs(sonar_vel) > 7) {
			  sonar_alt = sonar_alt_;
			  sonar_vel = sonar_vel_;
		  }

		  if(sonar_alt > 6 || sonar_alt < 0.3) {
			  EKF.Qs = 9e9;
			  EKF.salt = 50;
		  }

		  else {
			  EKF.Qs = 0.25;
			  EKF.salt = 1;
		  }


		}

		if(get_b_counter() == 1) {
			write_ut();
		}

		else if(get_b_counter() == 5) { //5 ms
			bmp.uncomp.temp = read_ut ();
			bmp.data.temp = get_temp (&bmp);
			write_up();
		}

