moralkerim/STM32Quadrotor/Drone_Controller_3DOF/Core/Src/main.cpp
		else if(get_b_counter() == 12) { //
			bmp.uncomp.press = read_up (bmp.oss);
			bmp.data.press = get_pressure (bmp);
			bmp.data.altitude = get_altitude (&bmp);
			baro_alt = bmp.data.altitude;


		}
#endif

		if(controller_counter == CONTROLLER_RATE) { //5 ms || 200 Hz
			_controller_timer = controller_timer;
			controller_timer = HAL_GetTick();
			controller_timer_dif = controller_timer-_controller_timer;
			controller_counter = 0;


#ifdef UAV1

		  gyroX = (GyroOku(GYRO_X_ADDR)- GyroXh)/14.375 ;
		  gyroY = (GyroOku(GYRO_Y_ADDR)- GyroYh)/14.375 ;
		  gyroZ = (GyroOku(GYRO_Z_ADDR)- GyroZh)/14.375 ;
		  //gyroX_a_x = (GyroOku(GYRO_X_ADDR)-gyro_e_x)/14.375;
		  //gyroX_a += gyroX_a_x * st;

#ifdef BMO_DEBUG
		  v = bno055_getVectorEuler();
		  bno_dat.x = v.y+3;
		  bno_dat.y = v.z-10;
		  bno_dat.z = v.x;

		  bno055_vector_t gv = bno055_getVectorGyroscope();
		  bno_gyro.x = -gv.y;
		  bno_gyro.y = -gv.x;
		  bno_gyro.z =  gv.z;
#endif

		  //float gyro[3];
		  EKF.gyro[0] = gyroX;
		  EKF.gyro[1] = -1*gyroY;
		  EKF.gyro[2] = gyroZ;


		  //İvmeölçer degerlerini oku

		  accX = AccOku(ACC_X_ADDR);
		  accY = AccOku(ACC_Y_ADDR);
		  accZ = AccOku(ACC_Z_ADDR);

		  accX = (1+Sx) * accX + bx;
		  accY = (1+Sy) * accY + by;
		  accZ = (1+Sz) * accZ + bz;

		  accXc = (float)accX* 0.0078;
		  accYc = (float)accY* 0.0078;
		  accZc = (float)accZ* 0.0078;

		  //float acc[3];
		  EKF.acc[0] = accX;// - AccXh;
		  EKF.acc[1] = accY;// - AccYh;
		  EKF.acc[2] = accZ;// - AccZh;

		  //float acctop=sqrt(accX*accX+accY*accY+accZ*accZ);		//Toplam ivme
		  //Check if healty acc

		 // pitch_acc=asin(accY/acctop)*57.324;					//İvme ölçerden hesaplanan pitch açısı

		  float g = 9.81;
		  float roll_r  = deg2rad*EKF.state.angles[0];
		  float pitch_r = deg2rad*EKF.state.angles[1];

		  //g body components, Without * g
		  float gx = sin(pitch_r);
		  float gy = cos(pitch_r)*sin(roll_r);
		  float gz = cos(roll_r)*cos(pitch_r);



		  accXc -= gx;
		  accYc -= gy;
		  accZc -= gz;

		  //Body to Local
		  accXm = accXc*cos(pitch_r) - accZc*cos(roll_r)*sin(pitch_r) - accYc*sin(roll_r)*sin(pitch_r);
		  accYm = accYc*cos(roll_r) - accZc*sin(roll_r);
		  accZm = accZc*cos(roll_r)*cos(pitch_r) + accXc*sin(pitch_r) + accYc*cos(pitch_r)*sin(roll_r);


		  accXm *= g; accYm *= g; accZm *= g;

		  EKF.acc_vert = accZm;

		  EKF.accXm = accXm;// * deg2rad*EKF.state.angles[1];
		  EKF.accYm = accYm;
//		  EKF.acc_pos_x = accXm;
//		  EKF.acc_pos_y = -accYm;

		  EKF.sonar_alt = sonar_alt;
		  EKF.baro_alt = baro_alt;
		  EKF.yaw_acc  = -1*euler_angles.yaw;

		  EKF.Run();


		  state.angles[0]  	  = EKF.state.angles[0];
		  state.angles[1] 	  = EKF.state.angles[1];
		  state.angles[2]     = EKF.state.angles[2];

		  state.rates[0] = EKF.state.rates[0];
		  state.rates[1] = EKF.state.rates[1];
		  state.rates[2] = EKF.state.rates[2];

//		  state.angles[0] = bno_dat.x;
//		  state.angles[1] = bno_dat.y;
//		  state.angles[2] = bno_dat.z;
//
//		  state.rates[0] = bno_gyro.x;
//		  state.rates[1] = bno_gyro.y;
//		  state.rates[2] = bno_gyro.z;

		   checkMode(ch[MOD_CH-1]);

		   controller.z_vel = EKF.vz;
		   controller.z = EKF.alt_gnd;

//		   controller.vx	 = EKF.vx;
//		   controller.x     = EKF.x;
//
//		   controller.vy	 = EKF.vy;
//		   controller.y     = EKF.y;

		  controller.state = state;
		  controller.state_des = state_des;
		  controller.ch3 = ch[2];
		  controller.ch2 = ch[1];
		  controller.ch1 = ch[0];
		  controller.Run();



		  controller_output[0] = controller.controller_output_pwm[0];
		  controller_output[1] = controller.controller_output_pwm[1];
		  controller_output[2] = controller.controller_output_pwm[2];
		  controller_output[3] = controller.controller_output_pwm[3];
#endif
		#ifdef UAV1

		  if(armed) {



			  if(ch[EMERGENCY_CH-1] < 1500 && ch[3-1] > CH3_MIN + 100) {

				  controller_output_2[0] = controller.controller_output_pwm2[0];
				  controller_output_2[1] = controller.controller_output_pwm2[1];
				  controller_output_2[2] = controller.controller_output_pwm2[2];
				  controller_output_2[3] = controller.controller_output_pwm2[3];

			  }

			  else {
				  controller_output_2[0] = 1000;
				  controller_output_2[1] = 1000;
				  controller_output_2[2] = 1000;
				  controller_output_2[3] = 1000;
			  }

		  }

		  else {
			  controller_output_2[0] = 1000;
			  controller_output_2[1] = 1000;
			  controller_output_2[2] = 1000;
			  controller_output_2[3] = 1000;
		  }
		#endif

		  state_des.rates[0] = controller.roll_rate_des;
		  state_des.rates[1] = controller.pitch_rate_des;


		  TelemPack();
		  CheckFailsafe();
		  CheckSwarm();
		  PWMYaz();

//		#ifdef UAV1
//		  	  	//Pack motor outputs to nrf24 buffer.
//		  	  	char nrf_buf[sizeof(struct pwm)];
//		  	  	memcpy(nrf_buf,&telem_pack.pwm2,sizeof(struct pwm));
//				NRF24_write(nrf_buf, sizeof(struct pwm));
//				HAL_GPIO_TogglePin(LED_GPIO_Port, LED_Pin);
//		#endif

		  //SwitchMag();

		  //HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_1);
		}
		}
	}

void HAL_TIM_IC_CaptureCallback(TIM_HandleTypeDef *htim)

{

 if(htim == &htim3) {


	if (htim->Channel == HAL_TIM_ACTIVE_CHANNEL_3)  // if the interrupt source is channel1
	{
				IC_Val1 = IC_Val2;
				IC_Val2 = HAL_TIM_ReadCapturedValue(htim, TIM_CHANNEL_3);  // read second value
				Diff = IC_Val2-IC_Val1;
				if(Diff < 0) {
					Diff+=65535;

				}
				//printf("Diff: %d\n",Diff);
					if(Diff >= 800 && Diff <= 2000) {
					#ifdef UAV1
						ch_[i] = ch[i];
						ch[i] = Diff;
						ch_count++;
					#endif

					#ifdef UAV2
						if(i == EMERGENCY_CH-1) {
							ch_[i] = ch[i];
							ch[EMERGENCY_CH-1] = Diff;
						}

						ch_count++;
					#endif

					}

					else if(Diff > CH0) {
						//ch[CH_NUM] = ch[i];
						i = -1;
						ch[CH_NUM] = Diff;
						sync = 1;
					}




				state_des.angles[0] =  pwm2ang(ch[0]);
				state_des.angles[1] =  pwm2ang(ch[1]);
				state_des.angles[2] =  0;
				state_des.rates[2] = pwm2rate(ch[3]);

				i++;
				i = i % (CH_NUM+1);
			//	__HAL_TIM_SET_CAPTUREPOLARITY(htim,TIM_CHANNEL_2,TIM_INPUTCHANNELPOLARITY_RISING);


	 }
	}
}
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
